{
	"id": 3,
	"languages": [
		{
		    "lang": "en",
            "title": "Function with Parameters",
            "description": "Learn how to define and use functions with parameters in C++.",
            "content": "This task will help you understand how to create functions that accept parameters. To complete it, you need to ensure that the function named 'sumTwoNumbers', which takes two integer parameters that we provided, returns the sum of the two integers.",
            "note": "1. A function is a reusable block of code that performs a specific task. In this task, you will create a function called 'sumTwoNumbers' that takes two integer parameters and returns their sum.\n2. The function should have the following parameters:\n   - **int a**: The first integer.\n   - **int b**: The second integer.\n3. Inside the function body, you should use the `return` statement to return the result of adding the two parameters: `return a + b;`.\n4. Ensure that you follow proper function declaration syntax, which includes specifying the return type (int), the function name (sumTwoNumbers), and the parameters.\n5. After defining the function, you can call it from the `main` function to see the result. Make sure to pass two integers as arguments when calling the function."
        },
		{
			"lang": "tr",
            "title": "Parametre Alan Fonksiyon",
            "description": "Parametre alan fonksiyonları nasıl tanımlayacağınızı ve kullanacağınızı öğrenin.",
            "content": "Bu görev, parametre kabul eden fonksiyonları oluşturmayı anlamanıza yardımcı olacaktır. Tamamlamak için size vermiş olduğumuz İki tam sayı parametresi alan ve bunların toplamını döndüren 'sumTwoNumbers' adlı bir fonksiyonun iki tam sayının toplamını döndürmesini sağlamaktır.",
            "note": "1. Fonksiyon, belirli bir görevi yerine getiren ve tekrar kullanılabilen bir kod bloğudur. Bu görevde, iki tam sayı parametresi alan 'sumTwoNumbers' adlı bir fonksiyon yazmanız gerekiyor.\n2. Fonksiyonun aşağıdaki parametreleri olmalıdır:\n   - **int a**: Birinci tam sayı.\n   - **int b**: İkinci tam sayı.\n3. Fonksiyon gövdesinde, iki parametreyi toplamak için geri döndürme ifadesini kullanmalısınız: `return a + b;`.\n4. Doğru fonksiyon bildirimi sentaksına dikkat edin; bu, geri dönüş türünü (int), fonksiyon adını (sumTwoNumbers) ve parametreleri belirtmeyi içerir.\n5. Fonksiyonu tanımladıktan sonra, onu `main` fonksiyonu içinde çağırarak sonucu görebilirsiniz. Fonksiyonu çağırırken iki tam sayıyı argüman olarak geçmeyi unutmayın."
        }
	],
	"quest": {
		"difficulty": 2,
		"funcName": "sumTwoNumbers",
		"tests": [
			{
				"input": [3, 5],
				"output": [8]
			},
			{
				"input": [10, 15],
				"output": [25]
			}
		],
		"codeTemplates": [
			{
				"programmingID": 1,
				"templatePath": "object/paths/c++/3/template.txt"
			}
		]
	}
}
