{
	"id": 4,
	"languages": [
		{
            "lang": "en",
            "title": "Conditional Statements",
            "description": "Understanding conditional statements in C++",
            "content": "Learn how to use if-else statements to make decisions in a C++ program. In this task, you are provided with a function called 'checkEvenOdd'. Your task is to determine whether the given number is even or odd using control structures (if-else). You can use the following structure: **if(condition){\n \\code to be executed if condition is true\n}else{\n \\code to be executed if condition is false\n}**.",
            "note": "1. In this task, you will create a function called 'checkEvenOdd' that checks whether a given integer is even or odd.\n2. Start by defining the function with the following syntax:\n   - **Return Type**: The function should return a string, so use `std::string` as the return type.\n   - **Function Name**: The name of the function should be `checkEvenOdd`.\n   - **Parameters**: The function should take one integer parameter, which represents the number to be checked.\n3. Inside the function, use an if-else statement to determine if the number is even or odd:\n   - The `if` statement evaluates a condition (in this case, whether the number is divisible by 2).\n   - If the condition is true, the code block within the `if` statement executes, returning 'Even'.\n   - If the condition is false, the code block within the `else` statement executes, returning 'Odd'.\n"
        },
        {
            "lang": "tr",
            "title": "Koşullu İfadeler",
            "description": "C++'ta koşullu ifadeleri kullanmayı öğrenin.",
            "content": "C++ programında if-else ifadelerini kullanarak nasıl karar vereceğinizi öğreneceğiniz bir uygulama olacaktır. Bu görev için size checkEvenOdd fonksiyonu verilmiştir. Sizin göreviniz kontrol yapılarını(if-else) kullanarak verilen sayının çift mi yoksa tek mi olduğunu belirlemektir. Bunun için **if(şart){\n \\şart sağlanırsa yapılacak işlem\n}else{\n \\şart sağlanmazsa yapılacak işlem\n}** yapısını kullanabilirsiniz.",
            "note": "1. Bu görevde, bir tam sayının çift mi yoksa tek mi olduğunu kontrol eden 'checkEvenOdd' adlı bir fonksiyon yazmanız gerekiyor.\n2. Fonksiyonu tanımlarken aşağıdaki sentaksı kullanın:\n   - **Geri Dönüş Türü**: Fonksiyon bir string döndüreceği için geri dönüş türü olarak `std::string` kullanmalısınız.\n   - **Fonksiyon Adı**: Fonksiyonun adı 'checkEvenOdd' olmalıdır.\n   - **Parametreler**: Fonksiyon bir tam sayı parametresi almalıdır; bu, kontrol edilecek sayıyı temsil eder.\n3. Fonksiyonun içinde, sayının çift mi yoksa tek mi olduğunu belirlemek için bir if-else ifadesi kullanın:\n   - `if` ifadesi, belirli bir koşulu değerlendirir (bu durumda, sayının 2'ye bölünüp bölünmediğini).\n   - Eğer koşul doğruysa, `if` ifadesinin içindeki kod bloğu çalışır ve 'Even' döndürülür.\n   - Eğer koşul yanlışsa, `else` ifadesinin içindeki kod bloğu çalışır ve 'Odd' döndürülür.\n"
        }
	],
	"quest": {
		"difficulty": 1,
		"funcName": "checkEvenOdd",
		"tests": [
			{
				"input": [4],
				"output": ["Even"]
			},
			{
				"input": [7],
				"output": ["Odd"]
			}
		],
		"codeTemplates": [
			{
				"programmingID": 1,
				"templatePath": "object/paths/c++/4/template.txt"
			}
		]
	}
}
