{
	"id": 2,
	"languages": [
		{
            "lang": "en",
            "title": "Function Definition and Usage",
            "description": "Learn how to define and use functions.",
            "content": "This task will help you understand how to use functions in C++.",
            "note": "1. A function is a block of code that performs a specific task and can be reused in your program.\n2. If you want to send values to your function, you need to pass parameters between the parentheses, but this is not mandatory; you can also define a function without parameters.\n3. Functions are divided into two types: those that return values and those that do not. If your function will return a value, you must specify the data type you want to return (for example: `int`, `float`). If it does not return a value, it should be declared with the `void` keyword.\n\n4. In this task, you need to write a function called 'getMessage' that does not take any parameters and returns a value. This function should return a message of type `std::string`.\n\n5. In the body of the function, you should use the `return` statement to define the message you want to return. For example: `return \"Hello, this is a message!\";`.\n\n6. After defining the function, you should call it within the `main` function to print the returned message. In this task, the main function is already provided and called for you. Your task is to ensure that the function returns the string \"Learning C++ is fun!\".\n7. Don't forget to add required imports."
        },
		{
            "lang": "tr",
            "title": "Fonksiyon Tanımı ve Kullanımı",
            "description": "Fonksiyonları nasıl tanımlayacağınızı ve kullanacağınızı öğrenin.",
            "content": "Bu görev, C++'ta fonksiyonların nasıl kullanılacağını anlamanıza yardımcı olacaktır.",
            "note": "1. Fonksiyon, belirli bir görevi yerine getiren ve programınızda tekrar kullanılabilen bir kod bloğudur.\n2. Eğer fonksiyonunuza değer göndermek istiyorsanız, parantezler arasına parametre adı verilen değerler göndermeniz gerekmektedir ancak bu zorunlu değildir; parametresiz fonksiyon da tanımlanabilmektedir.\n3. Fonksiyonlar, değer döndüren ve döndürmeyen olarak ikiye ayrılmaktadır. Eğer fonksiyonunuz bir değer döndürecekse, döndürmek istediğiniz veri tipini başına yazmalısınız (örneğin: `int`, `float`). Döndürmeyecekse de void takısını almaktadır.\n\n4. Bu görevde, parametre almayan ve geriye değer döndüren 'getMessage' adlı bir fonksiyon yazmanız gerekiyor. Bu fonksiyon, bir mesajı geri döndürecek ve `std::string` veri tipinde bir değer döndürmelidir.\n\n5. Fonksiyonun içeriğinde, geri döndürmek için `return` ifadesini kullanarak bir mesaj tanımlamalısınız. Örneğin: `return \"Hello, this is a message!\";` ifadesini kullanabilirsiniz.\n\n6. Fonksiyonu tanımladıktan sonra, onu `main` fonksiyonu içinde çağırarak dönen mesajı ekrana yazdırmalısınız. Bu görevde, main fonksiyonu içerisinde zaten çağrılıp size verilmiştir. Sizin yapmanız gereken fonksiyonun geriye \"Learning C++ is fun!\" stringini döndürmesini sağlamaktır.\n7. Gerekli importları yazmayı unutmayın!"
        }
	],
	"quest": {
		"difficulty": 2,
		"funcName": "getMessage",
		"tests": [
			{
				"input": [],
				"output": ["Learning C++ is fun!"]
			}
		],
		"codeTemplates": [
			{
				"programmingID": 1,
				"templatePath": "object/paths/c++/2/2.txt"
			}
		]
	}
}
